Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CM5112GC00100_DFP/component/ptc.h
#define PTC_YSEL2_YSEL_Pos                    _UINT32_(0)                                          /* (PTC_YSEL2) Y-Line Selection [63:32] Position */
#define PTC_YSEL2_YSEL_Msk                    (_UINT32_(0xF) << PTC_YSEL2_YSEL_Pos)                /* (PTC_YSEL2) Y-Line Selection [63:32] Mask */
#define PTC_YSEL2_YSEL(value)                 (PTC_YSEL2_YSEL_Msk & (_UINT32_(value) << PTC_YSEL2_YSEL_Pos)) /* Assignment of value for YSEL in the PTC_YSEL2 register */
#define PTC_YSEL2_Msk                         _UINT32_(0x0000000F)                                 /* (PTC_YSEL2) Register Mask  */


/* -------- PTC_POLCTRL1 : (PTC Offset: 0x40) (R/W 32) Polarity Control 1 Register -------- */
#define PTC_POLCTRL1_RESETVALUE               _UINT32_(0x00)                                       /*  (PTC_POLCTRL1) Polarity Control 1 Register  Reset Value */

#define PTC_POLCTRL1_POLARITY_Pos             _UINT32_(0)                                          /* (PTC_POLCTRL1) Choose X/Y lines Polarity [31:0] Position */
#define PTC_POLCTRL1_POLARITY_Msk             (_UINT32_(0xFFFFFFFF) << PTC_POLCTRL1_POLARITY_Pos)  /* (PTC_POLCTRL1) Choose X/Y lines Polarity [31:0] Mask */
#define PTC_POLCTRL1_POLARITY(value)          (PTC_POLCTRL1_POLARITY_Msk & (_UINT32_(value) << PTC_POLCTRL1_POLARITY_Pos)) /* Assignment of value for POLARITY in the PTC_POLCTRL1 register */
#define PTC_POLCTRL1_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (PTC_POLCTRL1) Register Mask  */


/* -------- PTC_POLCTRL2 : (PTC Offset: 0x44) (R/W 32) Polarity Control 2 Register -------- */
#define PTC_POLCTRL2_RESETVALUE               _UINT32_(0x00)                                       /*  (PTC_POLCTRL2) Polarity Control 2 Register  Reset Value */

#define PTC_POLCTRL2_POLARITY_Pos             _UINT32_(0)                                          /* (PTC_POLCTRL2) Choose X/Y lines Polarity [63:32] Position */
#define PTC_POLCTRL2_POLARITY_Msk             (_UINT32_(0xF) << PTC_POLCTRL2_POLARITY_Pos)         /* (PTC_POLCTRL2) Choose X/Y lines Polarity [63:32] Mask */
#define PTC_POLCTRL2_POLARITY(value)          (PTC_POLCTRL2_POLARITY_Msk & (_UINT32_(value) << PTC_POLCTRL2_POLARITY_Pos)) /* Assignment of value for POLARITY in the PTC_POLCTRL2 register */
#define PTC_POLCTRL2_Msk                      _UINT32_(0x0000000F)                                 /* (PTC_POLCTRL2) Register Mask  */


/* -------- PTC_INTENCLR : (PTC Offset: 0x48) (R/W 32) INTERRUPT ENABLE CLEAR Register -------- */
#define PTC_INTENCLR_RESETVALUE               _UINT32_(0x00)                                       /*  (PTC_INTENCLR) INTERRUPT ENABLE CLEAR Register  Reset Value */

#define PTC_INTENCLR_EOC_Pos                  _UINT32_(0)                                          /* (PTC_INTENCLR) End of Conversion Enable Clear. Position */
#define PTC_INTENCLR_EOC_Msk                  (_UINT32_(0x1) << PTC_INTENCLR_EOC_Pos)              /* (PTC_INTENCLR) End of Conversion Enable Clear. Mask */
#define PTC_INTENCLR_EOC(value)               (PTC_INTENCLR_EOC_Msk & (_UINT32_(value) << PTC_INTENCLR_EOC_Pos)) /* Assignment of value for EOC in the PTC_INTENCLR register */
#define PTC_INTENCLR_WCOMP_Pos                _UINT32_(1)                                          /* (PTC_INTENCLR) Window Comparator Enable Clear. Position */
#define PTC_INTENCLR_WCOMP_Msk                (_UINT32_(0x1) << PTC_INTENCLR_WCOMP_Pos)            /* (PTC_INTENCLR) Window Comparator Enable Clear. Mask */
#define PTC_INTENCLR_WCOMP(value)             (PTC_INTENCLR_WCOMP_Msk & (_UINT32_(value) << PTC_INTENCLR_WCOMP_Pos)) /* Assignment of value for WCOMP in the PTC_INTENCLR register */
#define PTC_INTENCLR_ACRRDY_Pos               _UINT32_(7)                                          /* (PTC_INTENCLR) Analog Core Ready Enable Clear. Position */
#define PTC_INTENCLR_ACRRDY_Msk               (_UINT32_(0x1) << PTC_INTENCLR_ACRRDY_Pos)           /* (PTC_INTENCLR) Analog Core Ready Enable Clear. Mask */
#define PTC_INTENCLR_ACRRDY(value)            (PTC_INTENCLR_ACRRDY_Msk & (_UINT32_(value) << PTC_INTENCLR_ACRRDY_Pos)) /* Assignment of value for ACRRDY in the PTC_INTENCLR register */
#define PTC_INTENCLR_Msk                      _UINT32_(0x00000083)                                 /* (PTC_INTENCLR) Register Mask  */


/* -------- PTC_INTENSET : (PTC Offset: 0x4C) (R/W 32) INTERRUPT ENABLE SET Register -------- */
#define PTC_INTENSET_RESETVALUE               _UINT32_(0x00)                                       /*  (PTC_INTENSET) INTERRUPT ENABLE SET Register  Reset Value */

#define PTC_INTENSET_EOC_Pos                  _UINT32_(0)                                          /* (PTC_INTENSET) End of Conversion Enable Set. Position */
#define PTC_INTENSET_EOC_Msk                  (_UINT32_(0x1) << PTC_INTENSET_EOC_Pos)              /* (PTC_INTENSET) End of Conversion Enable Set. Mask */
#define PTC_INTENSET_EOC(value)               (PTC_INTENSET_EOC_Msk & (_UINT32_(value) << PTC_INTENSET_EOC_Pos)) /* Assignment of value for EOC in the PTC_INTENSET register */
#define PTC_INTENSET_WCOMP_Pos                _UINT32_(1)                                          /* (PTC_INTENSET) Window Comparator Enable Set. Position */
#define PTC_INTENSET_WCOMP_Msk                (_UINT32_(0x1) << PTC_INTENSET_WCOMP_Pos)            /* (PTC_INTENSET) Window Comparator Enable Set. Mask */
#define PTC_INTENSET_WCOMP(value)             (PTC_INTENSET_WCOMP_Msk & (_UINT32_(value) << PTC_INTENSET_WCOMP_Pos)) /* Assignment of value for WCOMP in the PTC_INTENSET register */
#define PTC_INTENSET_ACRRDY_Pos               _UINT32_(7)                                          /* (PTC_INTENSET) Analog Core Ready Enable Set. Position */
#define PTC_INTENSET_ACRRDY_Msk               (_UINT32_(0x1) << PTC_INTENSET_ACRRDY_Pos)           /* (PTC_INTENSET) Analog Core Ready Enable Set. Mask */
#define PTC_INTENSET_ACRRDY(value)            (PTC_INTENSET_ACRRDY_Msk & (_UINT32_(value) << PTC_INTENSET_ACRRDY_Pos)) /* Assignment of value for ACRRDY in the PTC_INTENSET register */
#define PTC_INTENSET_Msk                      _UINT32_(0x00000083)                                 /* (PTC_INTENSET) Register Mask  */


/* -------- PTC_INTFLAGSET : (PTC Offset: 0x50) (R/W 32) INTERRUPT FLAG SET Register -------- */
#define PTC_INTFLAGSET_RESETVALUE             _UINT32_(0x00)                                       /*  (PTC_INTFLAGSET) INTERRUPT FLAG SET Register  Reset Value */

#define PTC_INTFLAGSET_EOC_Pos                _UINT32_(0)                                          /* (PTC_INTFLAGSET) End of Conversion Enable Set. Position */
#define PTC_INTFLAGSET_EOC_Msk                (_UINT32_(0x1) << PTC_INTFLAGSET_EOC_Pos)            /* (PTC_INTFLAGSET) End of Conversion Enable Set. Mask */
#define PTC_INTFLAGSET_EOC(value)             (PTC_INTFLAGSET_EOC_Msk & (_UINT32_(value) << PTC_INTFLAGSET_EOC_Pos)) /* Assignment of value for EOC in the PTC_INTFLAGSET register */
#define PTC_INTFLAGSET_WCOMP_Pos              _UINT32_(1)                                          /* (PTC_INTFLAGSET) Window Comparator Enable Set. Position */
#define PTC_INTFLAGSET_WCOMP_Msk              (_UINT32_(0x1) << PTC_INTFLAGSET_WCOMP_Pos)          /* (PTC_INTFLAGSET) Window Comparator Enable Set. Mask */
#define PTC_INTFLAGSET_WCOMP(value)           (PTC_INTFLAGSET_WCOMP_Msk & (_UINT32_(value) << PTC_INTFLAGSET_WCOMP_Pos)) /* Assignment of value for WCOMP in the PTC_INTFLAGSET register */
#define PTC_INTFLAGSET_ACRRDY_Pos             _UINT32_(7)                                          /* (PTC_INTFLAGSET) Analog Core Ready Enable Set. Position */
#define PTC_INTFLAGSET_ACRRDY_Msk             (_UINT32_(0x1) << PTC_INTFLAGSET_ACRRDY_Pos)         /* (PTC_INTFLAGSET) Analog Core Ready Enable Set. Mask */
#define PTC_INTFLAGSET_ACRRDY(value)          (PTC_INTFLAGSET_ACRRDY_Msk & (_UINT32_(value) << PTC_INTFLAGSET_ACRRDY_Pos)) /* Assignment of value for ACRRDY in the PTC_INTFLAGSET register */
#define PTC_INTFLAGSET_Msk                    _UINT32_(0x00000083)                                 /* (PTC_INTFLAGSET) Register Mask  */


/* -------- PTC_INTFLAG : (PTC Offset: 0x54) (R/W 32) INTERRUPT FLAG STATUS and CLEAR Register -------- */
#define PTC_INTFLAG_RESETVALUE                _UINT32_(0x00)                                       /*  (PTC_INTFLAG) INTERRUPT FLAG STATUS and CLEAR Register  Reset Value */

#define PTC_INTFLAG_EOC_Pos                   _UINT32_(0)                                          /* (PTC_INTFLAG) End of Conversion Flag Position */
#define PTC_INTFLAG_EOC_Msk                   (_UINT32_(0x1) << PTC_INTFLAG_EOC_Pos)               /* (PTC_INTFLAG) End of Conversion Flag Mask */
#define PTC_INTFLAG_EOC(value)                (PTC_INTFLAG_EOC_Msk & (_UINT32_(value) << PTC_INTFLAG_EOC_Pos)) /* Assignment of value for EOC in the PTC_INTFLAG register */
#define PTC_INTFLAG_WCOMP_Pos                 _UINT32_(1)                                          /* (PTC_INTFLAG) Window Comparator Flag Position */
#define PTC_INTFLAG_WCOMP_Msk                 (_UINT32_(0x1) << PTC_INTFLAG_WCOMP_Pos)             /* (PTC_INTFLAG) Window Comparator Flag Mask */
#define PTC_INTFLAG_WCOMP(value)              (PTC_INTFLAG_WCOMP_Msk & (_UINT32_(value) << PTC_INTFLAG_WCOMP_Pos)) /* Assignment of value for WCOMP in the PTC_INTFLAG register */
#define PTC_INTFLAG_ACRRDY_Pos                _UINT32_(7)                                          /* (PTC_INTFLAG) Analog Core Ready Flag Position */
#define PTC_INTFLAG_ACRRDY_Msk                (_UINT32_(0x1) << PTC_INTFLAG_ACRRDY_Pos)            /* (PTC_INTFLAG) Analog Core Ready Flag Mask */
#define PTC_INTFLAG_ACRRDY(value)             (PTC_INTFLAG_ACRRDY_Msk & (_UINT32_(value) << PTC_INTFLAG_ACRRDY_Pos)) /* Assignment of value for ACRRDY in the PTC_INTFLAG register */
#define PTC_INTFLAG_Msk                       _UINT32_(0x00000083)                                 /* (PTC_INTFLAG) Register Mask  */


/* -------- PTC_STATUS : (PTC Offset: 0x58) ( R/ 32) STATUS Register -------- */
#define PTC_STATUS_RESETVALUE                 _UINT32_(0x00)                                       /*  (PTC_STATUS) STATUS Register  Reset Value */

#define PTC_STATUS_PTCBUSY_Pos                _UINT32_(0)                                          /* (PTC_STATUS) PTC Busy Status Position */
#define PTC_STATUS_PTCBUSY_Msk                (_UINT32_(0x1) << PTC_STATUS_PTCBUSY_Pos)            /* (PTC_STATUS) PTC Busy Status Mask */
#define PTC_STATUS_PTCBUSY(value)             (PTC_STATUS_PTCBUSY_Msk & (_UINT32_(value) << PTC_STATUS_PTCBUSY_Pos)) /* Assignment of value for PTCBUSY in the PTC_STATUS register */
#define PTC_STATUS_DAD_Pos                    _UINT32_(7)                                          /* (PTC_STATUS) Digital Accumulation Done Position */
#define PTC_STATUS_DAD_Msk                    (_UINT32_(0x1) << PTC_STATUS_DAD_Pos)                /* (PTC_STATUS) Digital Accumulation Done Mask */
#define PTC_STATUS_DAD(value)                 (PTC_STATUS_DAD_Msk & (_UINT32_(value) << PTC_STATUS_DAD_Pos)) /* Assignment of value for DAD in the PTC_STATUS register */
#define PTC_STATUS_WCC_Pos                    _UINT32_(8)                                          /* (PTC_STATUS) Window Comparator Counter Position */
#define PTC_STATUS_WCC_Msk                    (_UINT32_(0x7F) << PTC_STATUS_WCC_Pos)               /* (PTC_STATUS) Window Comparator Counter Mask */
#define PTC_STATUS_WCC(value)                 (PTC_STATUS_WCC_Msk & (_UINT32_(value) << PTC_STATUS_WCC_Pos)) /* Assignment of value for WCC in the PTC_STATUS register */
#define PTC_STATUS_Msk                        _UINT32_(0x00007F81)                                 /* (PTC_STATUS) Register Mask  */


